# Path Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ImageType..::..Path Property
ImageType Class See Also
---
The path to the file from which the ImageType was loaded.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public string Path { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Path As String
	Get
```

Visual C++
---
```text
public:
property String^ Path {
	String^ get ();
}
```

# Remarks
The path string can be in one of several formats: absolute local, relative local, or server (indicating that the file was provided by an external server). The format is determined by PathType
The path can be an empty string, for example for (but not limited to) ImageTypes created using "Save to Project as Image".
# See Also
ImageType Class
Autodesk.Revit.DB Namespace